{
  "_name_or_path": "papluca/xlm-roberta-base-language-detection",
  "architectures": [
    "XLMRobertaForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "ja",
    "1": "nl",
    "2": "ar",
    "3": "pl",
    "4": "de",
    "5": "it",
    "6": "pt",
    "7": "tr",
    "8": "es",
    "9": "hi",
    "10": "el",
    "11": "ur",
    "12": "bg",
    "13": "en",
    "14": "fr",
    "15": "zh",
    "16": "ru",
    "17": "th",
    "18": "sw",
    "19": "vi"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "ar": 2,
    "bg": 12,
    "de": 4,
    "el": 10,
    "en": 13,
    "es": 8,
    "fr": 14,
    "hi": 9,
    "it": 5,
    "ja": 0,
    "nl": 1,
    "pl": 3,
    "pt": 6,
    "ru": 16,
    "sw": 18,
    "th": 17,
    "tr": 7,
    "ur": 11,
    "vi": 19,
    "zh": 15
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "xlm-roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.48.3",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 250002
}
